// Подсчитать количество максимумов
int[,,] array = {{
                  {1,2,3,4,5,6,5,4,5,6,5},
                  {2,4,3,2,6,5,6,2,1,6,0},
                  {2,3,2,4,6,6,5,4,3,4,6},
                  {6,0,3,1,6,5,6,2,1,6,0},
                  {6,5,4,3,4,6,5,4,3,6,4}
                 },
                 {
                  {0,2,3,4,5,6,5,4,5,6,6},
                  {2,4,6,2,6,5,6,2,1,6,0},
                  {2,6,2,4,6,6,5,4,3,4,6},
                  {6,0,3,1,6,5,6,2,1,6,0},
                  {6,5,4,3,4,6,5,4,3,6,4}
                 },
                 {
                  {1,0,3,4,5,3,5,4,5,4,5},
                  {2,2,3,2,0,5,6,2,1,4,0},
                  {2,3,2,4,6,6,5,4,3,4,6},
                  {6,0,3,1,6,5,6,2,1,2,0},
                  {2,5,4,3,4,2,5,4,3,1,6}
                 },
                 {
                  {1,6,3,4,5,3,5,4,5,4,5},
                  {2,2,3,2,2,5,6,2,1,4,0},
                  {2,3,2,4,3,6,5,4,3,4,6},
                  {3,0,3,1,3,5,6,2,1,2,0},
                  {2,5,4,3,4,2,5,4,3,1,1}
                 }
                 };

int Func(int[,,] arr)
{
    int max = arr[0, 0, 0];
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        for (int j = 0; j < arr.GetLength(1); j++)
        {
            for (int k = 0; k < arr.GetLength(2); k++)
            {
                if (arr[i, j, k] > max) max = arr[i, j, k];
            }
        }
    }
    return max;
}

int Func2(int[,,] arr2)
{
    int count = 0;
    for (int i = 0; i < arr2.GetLength(0); i++)
    {
        for (int j = 0; j < arr2.GetLength(1); j++)
        {
            for (int k = 0; k < arr2.GetLength(2); k++)
            {
                if (arr2[i, j, k] == Func(array)) count++;
            }
        }
    }
    return count;
}

Console.WriteLine(Func(array));
Console.WriteLine(Func2(array));
